Autodesk.Revit.DB.Electrical.CoreType
An enumerated type to list all core types.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Electrical.CoreType.MultiCore
Core type is multi core.

Autodesk.Revit.DB.Electrical.CoreType.SingleCore
Core type is single core.